{
  "labels": [],
  "comment": "※このコメントは Greptile による自動コードレビューです。",
  "fixWithAI": true,
  "strictness": 2,
  "commentTypes": [
    "logic"
  ],
  "instructions": "レビュー方針:\n\n- レビューコメントとサマリは日本語（です・ます調）で出力してください。\n- セキュリティリスク（SQLインジェクション、XSS、認可不備、機密情報の漏洩など）を最優先で確認してください。\n- 潜在的なバグ（型の不一致、エッジケース、エラーハンドリング不足など）を重点的にチェックしてください。\n- 可能な範囲でアーキテクチャとの整合性（既存パターンとの一貫性、設計原則への準拠）も評価してください。\n- 重大なパフォーマンス問題（N+1クエリ、明らかに非効率なアルゴリズムなど）があれば指摘してください。\n- 重要なロジックのテストが十分かどうかを確認し、不足していれば具体的なテスト追加案を提案してください。\n- コードの可読性（命名、複雑度、コメントの必要性）について、必要な場合のみ助言してください。スタイルだけの指摘は最小限にしてください。\n- 重大または警告レベルの指摘については、必ず「何が問題か」「なぜ問題か」「どう修正すべきか」の3点を含めてください。\n- ある変更が新しいパターンやルールを導入している場合（例: パスワードリセットメールに Expires ヘッダーを追加した場合）は、同じリポジトリ内の関連箇所（例: 他のトークンベースのメール）を調べ、一貫性の観点から「適用すべきか / 適用しないべきか」の結論を出してください。単に「検討すべき」と書くのではなく、どちらかの方針を明示し、その理由と、必要であれば具体的に変更すべきファイル・メソッド名を列挙してください。\n- 「どう修正すべきか」では、可能な限り具体的な修正方針と Ruby コードのサンプル（GitHub の suggestion 形式のコードブロック）を提示してください。\n- 各指摘について、可能な限り次の 4 つの要素を明確に分けて記述してください:\n  1. 観察（どのファイルのどの行で、どんなコードが書かれているか）\n  2. 理由（なぜそれが問題か。Ruby / Rails / Devise の仕様や振る舞いに基づいて説明してください）\n  3. 結論（それが実際のバグなのか、将来バグになり得る懸念なのか、単なる改善提案なのか）\n  4. 深刻度（🚨 重大 / ⚠️ 警告 / 💡 提案 のいずれか）\n- 重大や致命的といった強い表現を使う前に、そのコードが本当に実行時エラーやユーザー影響につながるかどうかを慎重に検討してください。自信が十分でない場合は「〜の可能性があります」のように不確実性を明示してください。\n- 改善提案レベル（💡 提案）のコメントでは、現在のコードはただちにバグになるわけではないが、こう変えると可読性や一貫性が高まる、といった位置づけを一文で明示してください。\n- 重大および警告レベルの指摘は、原則としてこの PR の差分で追加・変更されたコードと、その周辺のロジックに限定してください。この PR で変更していない既存コードだけを対象とする指摘は、明らかな脆弱性やクラッシュでない限り、💡 提案レベルとし、現在の PR のマージ可否を左右するような表現は避けてください。\n- この PR で変更していない既存コードに問題があると感じた場合は、「この PR 以前から存在していた可能性のある既存の問題です」と明示し、この変更によって悪化するのか、単に歴史的な負債なのかを区別してください。\n- 「この PR をマージすると機能が全く動作しない」「テストが失敗する」など強い主張をする場合は、どのテストケース（ファイル名・行番号）またはどのような入力シナリオで、どのような不具合が発生するかを具体的に説明してください。それを具体的に示せない場合は、深刻度を 1 段階下げてください。\n\nレビューのトーン:\n\n- 建設的で具体的な改善提案を心がけてください。\n- 問題の重要度を明確に示してください（例: 🚨 重大、⚠️ 警告、💡 提案）。\n- 良い実装や改善点があれば、肯定的なフィードバックも含めてください。",
  "disabledLabels": [],
  "excludeAuthors": [],
  "ignoreKeywords": "",
  "includeAuthors": [],
  "summarySection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": false
  },
  "excludeBranches": [],
  "includeBranches": [],
  "includeKeywords": "",
  "updateSummaryOnly": false,
  "issuesTableSection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": false
  },
  "confidenceScoreSection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": false
  },
  "sequenceDiagramSection": {
    "included": true,
    "collapsible": false,
    "defaultOpen": false
  },
  "shouldUpdateDescription": false,
  "updateExistingSummaryComment": false,
  "ignorePatterns": "greptile.json\n",
  "customContext": {
    "other": [
      {
        "scope": [],
        "content": ""
      }
    ],
    "rules": [
      {
        "scope": [],
        "rule": ""
      }
    ],
    "files": [
      {
        "scope": [],
        "path": "",
        "description": ""
      }
    ]
  }
}